Repository: akimerslys/MyWeeksBot
Catalog: src/bot/locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: Wrong Date
uk: Неправильна дата

# inline_create_notif_description
source: Use format <i>dd/mm/yyyy hh:mm</i> text Example: <i>01/01/2025 00:00</i> Happy New Year!
uk: Використуйте формат <i>dd/mm/yyyy hh:mm</i> <u>text</u> Наприклад: <i>01/01/2025 00:00</i> Happy New Year!<i>Наразі доступні лише англійски літери</i>

source: Wrong text
uk: Неправильний текст

# inline_wrong_text_description
source: Only A-Z, a-z, 0-9 are allowed. Create and share a new notification to use other symbols.
uk: Наразі доступні лише a-z, 0-9. Додайте та поширте сповіщення, щоб використовувати інші символи

# sign_in_inline
source: Sign In to use Bot
ru: 🔐 Зарегистрироваться
uk: 🔐 Зареєструватися

# inline_notif
source: 🔔 {date} ({tz}) 💬 {text}
ru: 🗓 <b>{date}</b> ({tz}) 💬 {text}
uk: 🔔 <b>{date}</b> ({tz}) 💬 {text}

# inline_create_notif
source: Create Notification
uk: Стовирити сповіщення

source: Share my schedule
ru: Поделиться расписанием
uk: Поділитися розкладом

source: schedule_description
ru: Поделитесь своим расписанием!
uk: Поділитися тижневим розкладом!

source: generated with @myweeksbot
ru: Сгенерировано из @myweeksbot ❤️
uk: Сгенеровано з @myweeksbot ❤️

source: schedule_description_day
ru: Поделитесь расписанием на сегодня!
uk: Поділитися сьогоднішнім розкладом!

source: ⭐️ Premium
ru: ⭐️ Премия
uk: ⭐️ Преміум

# schedule_configure
source: ✍️ Lets configure your schedule 🔔 When we should send your day schedule?
ru: ✍️ Давайте настроим ваше расписание 🔔 Когда мы отправляем ваше ежедневное расписание?
uk: ✍️ Давайте налаштуємо ваш розклад 🔔 Коли нам надсилати ваш розклад дня?

# WAIT_MESSAGE
source: ⌛️ please, wait a moment...
ru: ⌛️ Подождите...
uk: ⌛️ Будь ласка, зачекайте...

# ERROR_MESSAGE
source: ⚙️ Error, please use /report
ru: ⚙️ Ошибка, пожалуйста, используйте /report
uk: ⚙️ Помилка, будь ласка, використовуйте /report

# please_ch_button
source: Please, choose button below ⤵️
ru: Выберите один из вариантов ниже ⤵️
uk: Виберіть опцію нижче ⤵️

source: 📅 Choose days
ru: 📅 Выберите дни
uk: 📅 Виберіть дні

# choose_one_day
source: 📅 Choose day
ru: 📅 Выберите день
uk: 📅 Виберіть день

source: 🕔 Choose hours
ru: 🕔 Выберите часы работы
uk: 🕔 Виберіть години

source: 🕔 Choose minute
ru: 🕔 Выберите минуту
uk: 🕔 Оберіть хвилину

# add_text
source: 💬 Please, name your event (up to 30 characters)
ru: 💬 Придумать название (до 30 символов)
uk: 💬 Придумайте назву (до 30 символів)

source: Skip
ru: Мисс
uk: Пропустити

# add_schedule_info
source: 📅 Days: {days} 🕔 Time: {hours}:{minutes} 💬 Text: {text}
ru: 📅 Дни: {days} 🕔 Время: {hours}:{minutes} 💬 Текст: {text}
uk: 📅 Дні: {days} 🕔 Час: {hours}:{minutes} 💬 Текст: {text}

# limit_notifs
source: 😔 Sorry, you are out of notifications limit
ru: 😔 Извините, вы исчерпали лимит уведомлений
uk: 😔 На жаль, ви вичерпали ліміт сповіщень

source: ✅ Schedule updated
ru: ✅ Расписание обновлено
uk: ✅ Розклад оновлено

# no_schedule
source: 🤷‍♂️ You have no schedule yet
ru: 🤷 У вас еще нет расписания
uk: 🤷‍♂️ У вас ще немає розкладу

source: 📝 Your schedule
ru: 📝 Ваше расписание
uk: 📝 Ваш графік

# manage_one_schedule
source: 🗓 {day} 🕔 Time: {time} 💬 Text: {text}
ru: 🗓 {day} 🕔 Время: {time} 💬 Текст: {text}
uk: 🗓 {day} 🕔 Час: {time} 💬 Текст: {text}

# schedule_deleted
source: ✅ Delelted
ru: ✅ Удалено
uk: ✅ Видалено

source: 📅 Choose day
ru: 📅 Выберите день
uk: 📅 Виберіть день

# select_date
source: 👇 Please, select date
ru: 👇 Пожалуйста, выберите дату
uk: 👇 Будь ласка, виберіть дату

# choose_time_for_date
source: 🕔 Your date {date} 🕔 Please select a time:
ru: 🕔 Дата: {date} 🕔 Выберите время:
uk: 🕔 Дата: {date} 🕔 Виберіть час:

# add_text_notif
source: 💬 Write name of your notification: (up to 30 characters)
ru: 💬 Придумате название (до 30 символов)
uk: 💬 Придумайте назву (до 30 символів)

# add_notif_info
source: 📅 Date: {} ⏰ Time: {}:{} 💬 Text: {}
ru: 📅 Дата: {} ⏰ Время: {}:{} 💬 Текст: {}
uk: 📅 Дата: {} ⏰ Час: {}:{} 💬 Текст: {}

# notif_added
source: ✅ Notification added
ru: ✅ Добавлены уведомления
uk: ✅ Сповіщення додано

# share_notif_link
source: 🔗 Your link
ru: 🔗 Ваша ссылка
uk: 🔗 Ваше посилання

# no_notifs
source: 🤔 You have no notifications yet
ru: 🤔 У вас еще нет уведомлений
uk: 🤔 У вас ще немає сповіщень

# your_notifs
source: 📝 Your notifications
ru: 📝 Ваши уведомления
uk: 📝 Ваші сповіщення

# manage_one_notif
source: {status} 📅 Date: {date} ⏰ Time: {time} 📝 Text: {text}
ru: 📅 Дата: {date} ⏰ Время: {time} 📝 Текст: {text}
uk: 📅 Дата: {date} ⏰ Час: {time} 📝 Текст: {text}

source: 🟩 Active
ru: 🟩 Активно
uk: 🟩 Активний

source: 🟥 Inactive
ru: 🟥 Неактивно
uk: 🟥 Неактивний

# notif_deleted
source: ✅ Notification deleted
ru: ✅ Уведомления удалены
uk: ✅ Сповіщення видалено

# profile_info
source: 👤 <b>{name}</b>: 🔔 Notifications {active_notifs}/{max_notifs} ⭐️ Extra features: {extra} {premium_until}🇬🇧 Language: {lang} 🕔 Timezone: {tz} 🕔 Schedule time: {sch_time}
ru: 👤 <b>{name}</b>: 🔔 Оповещения {active_notifs}/{max_notifs} ⭐️ Дополнительные возможности: {extra} {premium_until} 🇬🇧 Язык: {lang} 🕔 Часовой пояс: {tz} 🕔 Расписание: {sch_time}
uk: 👤 <b>{name}</b>: 🔔 Сповіщення {active_notifs}/{max_notifs} ⭐️ Додаткові функції: {extra} {premium_until}🇬🇧 Мова: {lang} 🕔 Часовий пояс: {tz} 🕔 Розклад: {sch_time}

source: 🕔 Premium until:
ru: 🕔 Премиум до:
uk: 🕔 Преміум до:

# profile_delete_confirm
source: 😩 Are you sure you want to leave us?
ru: 😩 Вы уверены, что хотите уйти от нас?
uk: 😩 Ви впевнені, що хочете покинути нас?

source: Profile deleted, hope to see you again! ❤️‍🔥
ru: Данные удалены, надеемся увидеть вас снова! ❤️‍🔥
uk: Профіль видалено, сподіваємося знову побачити вас! ❤️‍🔥

# lang_changed
source: 🌐 Language changed to
ru: 🌐 Язык изменен на
uk: 🌐 Мову змінено на

# language
source: English 🇬🇧
ru: 🇷🇺 Русский
uk: 🇺🇦 Українська

# choose_timezone
source: 🕔 Choose your timezone
ru: 🕔 Выберите часовой пояс
uk: 🕔 Виберіть часовий пояс

# timezone_changed
source: 🕔 Timezone changed to {}
ru: 🕔 Часовой пояс изменен на {}
uk: 🕔 Часовий пояс змінено на {}

# send_geo_location
source: 📍 Send your location or press the button below to send it <i>Important note: <u>We don't store your location!</u></i>
ru: 📍 Отправьте геолокацию <i>Необязательно отправлять ваше местонахождение, вы можете выбрать город рядом</i>
uk: 📍 Надішліть геолокацію або натисніть кнопку нижче, щоб надіслати його <i>Важлива примітка: <u>Ми не зберігаємо геолокації!</u></i>

# timezone_geo_confirm
source: 🕔 This timezone correct? {timezone_str} Your Time should be {dtime}
ru: 🕔 Правильный ли этот часовой пояс? {timezone_str} Ваше время должно быть {dtime}
uk: 🕔 Цей часовий пояс правильний? {timezone_str} Ваш час має бути {dtime}

# cancel_location_btn
source: Cancel
ru: Отменить
uk: Скасувати

# start_menu
source: 👋 Hi, I'm MyWeeksBot! (beta) 🇬🇧 Your language is <i>{lang}</i> 🕔 Your timezone is <i>{tz}</i> ✅ To start using me, please complete the registration below
ru: 👋 Привет, я MyWeeksBot! 🇬🇧 Ваш язык <i>{lang}</i> 🕔 Ваш часовой пояс <i>{tz}</i> ✅ Чтобы начать пользоваться мной, пожалуйста, заполните регистрационную форму ниже
uk: 👋 Привіт, я MyWeeksBot! 🇬🇧 Ваша мова <i>{lang}</i> 🕔 Ваш часовий пояс <i>{tz}</i> ✅ Щоб почати користуватися мною, заповніть реєстрацію нижче

source: 📛 Timezone not changed
ru: 📛 Часовой пояс не изменился
uk: 📛 Часовий пояс не змінено

# timezone_contry_menu
source: 🙏 Please, choose timezone below or write your country code (ex. US - United States, cz - Czech Republic)
ru: 🙏 Пожалуйста, выберите страну из меню или напишите код вашей страны (например, UA - Украина, cz - Чехия)
uk: 🙏 Будь ласка, виберіть країну у меню або напишіть код вашої країни (напр. UA - Україна, cz - Чехія)

# timezone_country_invalide_code
source: Invalid country code, you can find your country code here https://telegra.ph/country-codes-03-08
ru: Неверный код страны Вы можете найти код своей страны перейдя по ссылке https://telegra.ph/country-codes-03-08
uk: Невірний код країни Знайти код країни ви можете за посиланням https://telegra.ph/country-codes-03-08

# schedule_configure_confirm
source: We will send your schedule everyday at {hrs}:{min}, right?
ru: ✍️ Мы будем отправлять ваше ежедневное расписание каждый день в {hrs}:{min}, хорошо?
uk: ✍️ Ми надсилатимемо ваш розклад дня щодня о {hrs}:{min}, добре?

source: 🗓 Last updates:
ru: 🗓 Последние обновления:
uk: 🗓 Останні оновлення:

# premium_activated
source: 🎉 Your premium has been {status} for {days} days
ru: 🎉 Ваш премиум {status} на {days} дней
uk: 🎉 Ваша преміум {status} протягом {days} днів

source: extended
ru: Увеличено
uk: розширений

source: activated
ru: Активированно
uk: активовано

# report_start
source: ✍️ Please send your report:
ru: ✍️ Напишите отчет:
uk: ✍️ Надішліть свій звіт:

# report_finish
source: 🥰 Thank you! Your report has been sent to the developers
ru: 🥰 Спасибо! Ваш отчет отправлен разработчикам
uk: 🥰 Дякуємо! Ваш звіт надіслано розробникам

# deeplink_got_notif
source: 💛 Got notification 🗓 Date: {date} ({tz}) 💬 Text: {text} ✅ <i>Complete the registration to add it!</i>
ru: 💛 Получено уведомление 🗓 Дата: {date} ({tz}) 💬 Текст: {text} ✅ <i>Завершите регистрацию, чтобы добавить его!</i>
uk: 💛 Отримав сповіщення 🗓 Дата: {date} ({tz}) 💬 Текст: {text} ✅ <i>Завершіть реєстрацію, щоб додати його!</i>

# notif_deeplink_logged
source: ✅ <i>Notification Added</i> 🗓 Date: {date} ({tz}) 💬 Text: {text}
ru: 🗓 Уведомления {date} ({tz}) (<i>{date} ({tz})</i>) 💬 {text}
uk: 🗓 Сповіщення {date} ({tz}) {tmp}💬{text}

# choose_lang
source: 🇬🇧 Choose your language
ru: 🇷🇺 Выберите язык
uk: 🇺🇦 Виберіть вашу мову

# choose_tz
source: 🕔 Choose your timezone
ru: 🕔 Выберите свой часовой пояс
uk: 🕔 Виберіть ваш часовий пояс

# pls_do_registration
source: Please, complete the registration first
ru: 🙏 Пожалуйста, сначала завершите регистрацию
uk: 🙏 Будь ласка, спочатку завершіть реєстрацію

# lang_changed_to
source: 🌐 Language changed to
ru: 🌐 Язык изменен на
uk: 🌐 Мову змінено на

# lang
source: English 🇬🇧
ru: 🇷🇺 Русский
uk: 🇺🇦 Українська

# tz_changed_answer
source: 🕔 Timezone changed to {}
ru: 🕔 Часовой пояс изменен на {}
uk: 🕔 Часовий пояс змінено на {}

# thank_you_guide
source: 😍 Thank you for completing the guide!
ru: 😍 Спасибо, что дочитали гайд!
uk: 😍 Дякуємо за завершення посібника!

# deeplink_notif_added
source: ✅ Notification added
ru: ✅ Добавлено уведомление
uk: ✅ Сповіщення додано

# reg_completed
source: ✅ Registration completed!
ru: ✅ Регистрация закрыта!
uk: ✅ Реєстрацію завершено!

# Language
source: English 🇬🇧
ru: 🇺🇦 Язык
uk: 🇺🇦 Мова

source: 🕔 Timezone
ru: 🕔 Часовой пояс
uk: 🕔 Часовий пояс

source: Guide
ru: 📖 Гайд
uk: 📖 Посібник

source: ✅ Complete Registration
ru: ✅ Завершите регистрацию
uk: ✅ Завершити реєстрацію

source: 🔙 Back
ru: 🔙 Назад
uk: 🔙 Назад

source: ◀️ Prev
ru: ◀️ Предыдущий
uk: ◀️ Поперед

source: ➡️ Next
ru: ➡️ Следующий
uk: ➡️ Далі

source: ✅ Complete
ru: ✅ Завершить
uk: ✅ Завершити

# add_notif_inline
source: 🔔 Add Notification
ru: 🔔 Добавить уведомление
uk: 🔔 Додати Сповіщення

source: 🔔 Notifications
ru: 🔔 Уведомления
uk: 🔔 Сповіщення

source: 📈 Schedule
ru: 📈 Расписание
uk: 📈 Розклад

# settings
source: ⚙️ Extra features
ru: ⚙️ Дополнительные функции
uk: ⚙️ Додаткові функції

source: ✅ Confirm
ru: ✅ Подтверждать
uk: ✅ Підтвердити

# show_schedule
source: 🗓 Your Schedule
ru: 🗓 Ваше расписание
uk: 🗓 Ваш розклад

source: 🔄 Update Schedule
ru: 🔄 График обновлений
uk: 🔄 Оновити Розклад

source: 🗓 Manage Schedule
ru: 🗓 Управление расписанием
uk: 🗓 Керувати розкладом

source: 👨‍💻 WorkDays
ru: 💻 Будни
uk: 👨‍💻 Робочі дні

source: 🛌 Weekends
ru: 🛌 Выходные
uk: 🛌 Вихідні

source: ➡️ Next
ru: ➡️ Следующий
uk: ➡️ Далі

# notify_off
source: 🔕 OFF
ru: 🔕 ВЫКЛ
uk: 🔕 ВИМКНЕНО

# notify_on
source: 🔔 ON
ru: 🔔 ВКЛ
uk: 🔔 УВІМКНЕНО

source: 🗑 Cancel
ru: 🗑 Отменить
uk: 🗑 Скасувати

source: ✅ Complete
ru: ✅ Добавлено
uk: ✅ Завершено

# add_another_schedule
source: 🔄 Update Schedule
ru: 🔄 Обновить расписание
uk: 🔄 Ще оновити розклад

# back_main
source: ⬅️ Back to main menu
ru: ⬅️ Вернуться в главное меню
uk: ⬅️ Повернутися до головного меню

source: 📅 Change day
ru: 📅 Изменить день
uk: 📅 Змінити день

source: 🕔 Change time
ru: 🕔 Время изменения
uk: 🕔 Змінити час

# schedule_delete
source: ❌ Delete
ru: ❌ Удалить
uk: ❌ Видалити

# add_notif
source: ➕ Add Notification
ru: ➕ Добавление уведомлений
uk: ➕ Додати сповіщення

# notifs
source: 📊 Manage Notifications
ru: 📊 Управление уведомлениями
uk: 📊 Керуйте сповіщеннями

source: Monday
ru: Понедельник
uk: Понеділок

source: Tuesday
ru: Вторник
uk: Вівторок

source: Wednesday
ru: Среда
uk: Середа

source: Thursday
ru: Четверг
uk: Четвер

source: Friday
ru: Пятница
uk: П'ятниця

source: Saturday
ru: Суббота
uk: Субота

source: Sunday
ru: Воскресенье
uk: Неділя

source: Today
ru: Сегодня
uk: Сьогодні

source: 🗓 Calendar
ru: 🗓 Календарь
uk: 🗓 Календар

# repeat_none
source: 1️⃣ Once
ru: 1️⃣ Одноразовое
uk: 1️⃣ Одноразове

# repeat_day
source: 🔄 Every day
ru: 🔄 Каждый день
uk: 🔄 Кожен день

# repeat_week
source: 🔄 Every week
ru: 🔄 Каждую неделю
uk: 🔄 Кожного тижня

# repeat_month
source: 🔄 Every month
ru: 🔄 Каждый месяц
uk: 🔄 Кожен місяць

# share_notif
source: ✉️ Share
ru: ✉️ Поделиться
uk: ✉️ Поділитися

source: ✉️ Share
ru: ✉️ Поделиться
uk: ✉️ Поділитися

# notif_text
source: 💬 Change text
ru: 💬 Изменить текст
uk: 💬 Змінити Текст

# notif_delete
source: ❌ Delete
ru: ❌ Удалить
uk: ❌ Видалити

# buy_premium
source: ⭐️ Premium
ru: ⭐️ Премиум
uk: ⭐️ Преміум

# set_lang
source: 🇬🇧 Language
ru: 🇺🇦 Язык
uk: 🇺🇦 Мова

# set_timezone
source: 🕔 Timezone
ru: 🕔 Часовой пояс
uk: 🕔 Часовий пояс

source: 👤 Profile
ru: 👤 Профиль
uk: 👤 Профіль

source: 📚 Changelog
ru: 📚 Список изменений
uk: 📚 Журнал змін

# buy_premium_donate
source: ⭐️ Premium
ru: ⭐️ Премия
uk: ⭐️ Преміум

# delete_all_info
source: ❌ Delete all your data
ru: ❌ Удалить все свои данные
uk: ❌ Видалити всі свої дані

source: ❌ Delete
ru: ❌ Удалить
uk: ❌ Видалити

source: loading...
ru: Ботинок...
uk: Завантаження...

source: 📍 Timezone by location
ru: 📍 По местоположению
uk: 📍 За місцезнаходженням

# timezone_country
source: 🇬🇧 Timezone by Country
ru: 🇺🇦 По стране
uk: 🇺🇦 За країною

# timezone_adv
source: 🕔 Timezone
ru: 🕔 Больше часовых поясов
uk: 🕔 Більше таймзон

# timezones_all
source: 🕔 All Timezones
ru: 🕔 Все часовые пояса
uk: 🕔 Усі таймзони

# send_location_btn
source: 📍 Send location
ru: 📍 Отправить геолокацию
uk: 📍 Надіслати геолокацію

# calendar_late_date
source: ❗️The date have to be before {date}
ru: ❗️Дата должна быть раньше, чем {date}
uk: ❗️Дата має бути раніше за {date}

# calendar_early_date
source: ❗️The date have to be later {date}
ru: ❗️Дата должна быть позже, чем {date}
uk: ❗️Дата має бути пізніше за {date}
